In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

In [2]:
path = '../Data/Raw Data'

In [3]:
df_ord = pd.read_csv(path + '/orders.csv')

In [4]:
df_ord.shape

(3421083, 7)

In [5]:
df_ord.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [7]:
# drop uneccessary column eval_set
df_ord = df_ord.drop(columns = ['eval_set'])

In [8]:
df_ord.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [11]:
# changing the data type for columns with unique values and numbers that equal a day of the week
df_ord[['order_id', 'user_id', 'order_number', 'order_dow']] = df_ord[['order_id', 'user_id', 'order_number', 'order_dow']].astype('str')

In [13]:
df_ord.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            object
 3   order_dow               object
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 156.6+ MB

In [14]:
# checking for missing data in Orders dataset
missing_values = df_ord.isnull().sum()
print(missing_values)

order_id                       0
user_id                        0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [15]:
# using the average number of days since prior order to impute that for the 206209 missing values in that column
average_value = df_ord['days_since_prior_order'].mean()
print(average_value)

11.114836226863012

In [17]:
#Imputing the value of 11 in the missing 206209 values
impute_value = 11
df_ord['days_since_prior_order'].fillna(impute_value, inplace = True)

In [18]:
missing_values = df_ord.isnull().sum()
print(missing_values)

order_id                  0
user_id                   0
order_number              0
order_dow                 0
order_hour_of_day         0
days_since_prior_order    0
dtype: int64

In [19]:
# Finding duplicates in orders data set
duplicate_rows = df_ord[df_ord.duplicated()]
print(duplicate_rows)

Empty DataFrame
Columns: [order_id, user_id, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

In [21]:
# saving clean orders dataset
path = '../Data/Clean Data'
df_ord.to_csv(os.path.join(path, 'orders_clean'))

# Cleaning Products Data Set

In [24]:
del df_ord

In [22]:
path = '../Data/Raw Data'

In [23]:
df_prod = pd.read_csv(path + '/products.csv')

In [25]:
df_prod.shape

(49693, 5)

In [26]:
df_prod.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [28]:
# dropping unnecessary column aisle_id as this project is for online shoppping
df_prod = df_prod.drop(columns = ['aisle_id'])

In [29]:
df_prod.head()

,product_id,product_name,department_id,prices
0,1,Chocolate Sandwich Cookies,19,5.8
1,2,All-Seasons Salt,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,1,10.5
4,5,Green Chile Anytime Sauce,13,4.3

In [30]:
# finding missing values 
missing_values = df_prod.isnull().sum()
print(missing_values)

product_id        0
product_name     16
department_id     0
prices            0
dtype: int64

In [34]:
# Deleting the 16 missing values
df_nan = df_prod[df_prod['product_name'].isnull() == True]

In [35]:
df_prod2 = df_prod[df_prod['product_name'].isnull() == False]

In [36]:
df_nan = df_prod2

In [37]:
df_prod2 = df_prod[df_prod['product_name'].isnull() == False]

In [38]:
missing_values = df_prod2.isnull().sum()
print(missing_values)

product_id       0
product_name     0
department_id    0
prices           0
dtype: int64

In [40]:
df_prod.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  int64
 1   product_name   49677 non-null  object
 2   department_id  49693 non-null  int64
 3   prices         49693 non-null  float64
dtypes: float64(1), int64(2), object(1)
memory usage: 1.5+ MB

In [42]:
del df_prod

In [47]:
# Finding duplicates in products data set
df_dups = df_prod2[df_prod2.duplicated()]

In [48]:
df_dups

,product_id,product_name,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,11,4.8
18459,18458,Ranger IPA,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,14,6.8
35495,35491,Adore Forever Body Wash,11,9.9

In [50]:
# deleting duplicates
df_prod3 = df_prod2.drop_duplicates()

In [51]:
df_prod3.shape

(49672, 4)

In [52]:
del df_prod2

In [53]:
# Looking for outliers on prices
max_value = df_prod3['prices'].nlargest(10)
print(max_value)

33666    99999.0
21554    14900.0
9020        25.0
19392       25.0
21468       25.0
25580       25.0
40490       25.0
9896        24.9
14207       24.9
36577       24.9
Name: prices, dtype: float64

In [54]:
# looking into rows with $9999 and $14900 prices
max_price_row = df_prod3.nlargest(5, 'prices')
print(max_price_row)

      product_id                      product_name department_id   prices
33666      33664             2 % Reduced Fat  Milk            16  99999.0
21554      21553  Lowfat 2% Milkfat Cottage Cheese            16  14900.0
9020        9020  Boneless Skinless Chicken Thighs            12     25.0
19392      19391         Turkey Breast Tenderloins            12     25.0
21468      21467            Wild Caught Raw Shrimp            12     25.0

In [55]:
# inputting the average US cost of 2% reduced fat milk: 4
row_index = 33666
impute_value = 4
df_prod3.at[row_index, 'prices'] = impute_value

In [56]:
# imputting the average US cost of lowfat 2% milkfat cottage cheese
row_index = 21554
impute_value = 4
df_prod3.at[row_index, 'prices'] = impute_value

In [57]:
max_price_row = df_prod3.nlargest(5, 'prices')
print(max_price_row)

      product_id                      product_name department_id  prices
9020        9020  Boneless Skinless Chicken Thighs            12    25.0
19392      19391         Turkey Breast Tenderloins            12    25.0
21468      21467            Wild Caught Raw Shrimp            12    25.0
25580      25579     Naturally Smoked Trout Fillet            12    25.0
40490      40486                   Chicken Tenders            12    25.0

In [59]:
# saving clean products dataset
path = '../Data/Clean Data'
df_prod3.to_csv(os.path.join(path, 'products_clean'))

In [60]:
del df_prod3

# Cleaning Departments Data set

In [61]:
path = '../Data/Raw Data'

In [62]:
df_dep = pd.read_csv(path + '/departments.csv')

In [63]:
df_dep.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [65]:
df_dep = df_dep.T

In [66]:
df_dep.head()

                        0
department_id  department
1                  frozen
2                   other
3                  bakery
4                 produce

In [67]:
# channging the first row to the header of columns
df_dep.columns = df_dep.iloc[0]

In [69]:
df_dep = df_dep.drop(df_dep.index[0])

In [70]:
df_dep

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [71]:
path = '../Data'

In [72]:
df_dep.to_csv(os.path.join(path, 'Clean Data', 'department_clean.csv'))

In [83]:
del df_dep